#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <algorithm>
#include <cassert>
#include <time.h>
#include <random>
#include <vector>
#include <unordered_map>
typedef long long ll;

/*
https://github.com/thregium/practice_baekjoon/blob/main/24000-24999/24902.c
boj의 index 님의 솔루션 코드로 공부해서 제출합니다.
*/

int N;//query num
int S[54];//현재 큐브의 상태
int pre[6];//이전 상태를 저장하는 작은 배열
int res[256];//큐브를 돌리는 순서
int len_count[256];//큐브를 돌린 횟수 각각의 횟수 ?
ll Q[3342336];//상태 저장용 큐
/*
*        +------+
*        | 1 2 3|
*        | 8 0 4|
*        | 7 6 5|
* +------+------+------+------+
* |373839|101112|192021|282930|
* |443640|17 913|261822|352731|
* |434241|161514|252423|343332|
* +------+------+------+------+
*        |464748|
*        |534549|
*        |525150|
*        +------+
* 
* 입력의 순서를 구현에 맞게 바꿔주는 배열
*/
const int tile_od[1 << 6] = {
	             1,  2,  3,
	             8,  0,  4,
	             7,  6,  5,
	37, 38, 39, 10, 11, 12, 19, 20, 21, 28, 29, 30,
	44, 36, 40, 17,  9, 13, 26, 18, 22, 35, 27, 31,
	43, 42, 41, 16, 15, 14, 25, 24, 23, 34, 33, 32,
	            46, 47, 48,
	            53, 45, 49,
	            52, 51, 50
};
void debug_print() {
	std::cout << "DEBUG::\n";
	for (int i = 0; i < 3; i++) {
		std::cout << "      ";
		for (int j = 0; j < 3; j++) {
			std::cout << S[tile_od[i * 3 + j]] << " ";
		}
		std::cout << "\n";
	}
	for (int i = 0; i < 3; i++) {
		std::cout << "      ";
		for (int j = 0; j < 12; j++) {
			std::cout << S[tile_od[9 + i * 12 + j]] << " ";
		}
		std::cout << "\n";
	}
	for (int i = 0; i < 3; i++) {
		std::cout << "      ";
		for (int j = 0; j < 3; j++) {
			std::cout << S[tile_od[45 + i * 3 + j]] << " ";
		}
		std::cout << "\n";
	}
	std::cout << "DEBUG::\n";
	return;
}
const char M[10] = "UFRBLD";
void print_sol(int len) {
	for (int i = 0; i < len; i++) {
		assert(res[i] > 0 && res[i] < 60);
		int f = res[i] / 10;
		int p = res[i] % 10;
		std::cout << M[f];
		assert(1 <= p && p <= 3);
		if (p == 2) std::cout << "2";
		else if (p == 3) std::cout << "'";
		std::cout << " ";
	}
	std::cout << "\n";
	return;
}
/*
*      >----------v
*      | +------+ |
*      | | 1 2 3| |
*      | | 8 0 4| |
*      *<| 7 6 5|-<
* +------+------+------+------+
* |373839|101112|192021|282930|
* |443640|17 913|261822|352731|
* |434241|161514|252423|343332|
* +------+------+------+------+
*        |464748|
*        |534549|
*        |525150|
*        +------+
*
* 각 면의 번호에 대해 시계방향으로 옆면 번호들을 매핑
*/
const int side_od[6][12] = {
	//{ 30, 29, 28, 21, 20, 19, 12, 11, 10, 39, 38, 37 },
	{ 12, 11, 10, 39, 38, 37, 30, 29, 28, 21, 20, 19 },
	{  7,  6,  5, 19, 26, 25, 48, 47, 46, 41, 40, 39 },
	{  5,  4,  3, 28, 35, 34, 50, 49, 48, 14, 13, 12 },
	{  3,  2,  1, 37, 44, 43, 52, 51, 50, 23, 22, 21 },
	{  1,  8,  7, 10, 17, 16, 46, 53, 52, 32, 31, 30 },
	{ 16, 15, 14, 25, 24, 23, 34, 33, 32, 43, 42, 41 }
};
/*
*        +------+
*        |   2  |
*        | 8   4|
*        |   6  |
* +------+------+------+------+
* |  38  |  11  |  20  |  29  |
* |44  40|17  13|26  22|35  31|
* |  42  |  15  |  24  |  33  |
* +------+------+------+------+
*        |  47  |
*        |53  49|
*        |  51  |
*        +------+
*
* 각 엣지에 면 번호 매칭
*/
const int edge_od[12][2] = {
	{  6, 11 },
	{  4, 20 },
	{  2, 29 },
	{  8, 38 },
	{ 47, 15 },
	{ 49, 24 },
	{ 51, 33 },
	{ 53, 42 },
	{ 13, 26 },
	{ 22, 35 },
	{ 31, 44 },
	{ 40, 17 }
};
/*
*        +------+
*        |      |
*        |      |
*        |      |
* +------+------+------+------+
* |      |      |      |      |
* |      |      |      |      |
* |      |      |      |      |
* +------+------+------+------+
*        |      |
*        |      |
*        |      |
*        +------+
* 이건 뭘까?
* 각 색상 쌍에 대응하는 엣지 조각의 번호를 매칭
* -1은 대응하는 조각이 없음
* 색상 쌍은 앞쪽 색 * 8 + 뒤쪽 색
*/
const int color_edge[64] = {
	-1, -1, -1, -1, -1, -1, -1, -1,
	-1, -1,  0,  1,  2,  3, -1, -1,
	-1,  0, -1,  0, -1, 11,  4, -1,
	-1,  1,  8, -1,  9, -1,  5, -1,
	-1,  2, -1,  9, -1, 10,  6, -1,
	-1,  3, 11, -1, 10, -1,  7, -1,
	-1, -1,  4,  5,  6,  7, -1, -1,
	-1, -1, -1, -1, -1, -1, -1, -1
};
/*
*        +------+
*        | 1   3|
*        |      |
*        | 7   5|
* +------+------+------+------+
* |37  39|10  12|19  21|28  30|
* |      |      |      |      |
* |43  41|16  14|25  23|34  32|
* +------+------+------+------+
*        |46  48|
*        |      |
*        |52  50|
*        +------+
* 
* 코너 조각에 면 번호 매칭
*/
const int corner_od[8][3] = {
	{ 39, 10, 7 },
	{ 41, 46, 16 },
	{ 43, 32, 52 },
	{ 37,  1, 30 },
	{ 19,  5, 12 },
	{ 25, 14, 48 },
	{ 23, 50, 34 },
	{ 21, 28,  3 },
};
/*
*      >----------v
*      | +------+ |
*      | |   2  | |
*      | | 3   1| |
*      *<|   0  |-<
* +------+------+------+------+
* |   3  |   0  |   1  |   2  |
* |10  11|11   8| 8   9| 9  10|
* |   7  |   4  |   5  |   6  |
* +------+------+------+------+
*        |   4  |
*        | 7   5|
*        |   6  |
*        +------+
*
* phase1, 2에서 돌아가는 엣지 조각의 순서
*/
const int oper_edge[6][4] = {
	//{ 2,  1, 0,  3 },
	{ 0,  3, 2,  1 },
	{ 0,  8, 4, 11 },
	{ 1,  9, 5,  8 },
	{ 2, 10, 6,  9 },
	{ 3, 11, 7, 10 },
	{ 4,  5, 6,  7 }
};


/* PHASE 1 */
int phase1_last[4096], phase1_oper[4096], phase1_dist[4096];
/*
*      >----------v
*      | +------+ |
*      | |   2  | |
*      | | 3   1| |
*      *<|   0  |-<
* +------+------+------+------+
* |   3  |   0  |   1  |   2  |
* |10  11|11   8| 8   9| 9  10|
* |   7  |   4  |   5  |   6  |
* +------+------+------+------+
*        |   4  |
*        | 7   5|
*        |   6  |
*        +------+
*
* phase1에서 돌아가는 엣지 조각의 순서
*/
const int oper1_edge[6][4] = {
	//{ 2,  1, 0,  3 },
	{ 0,  3, 2,  1 },
	{ 0,  8, 4, 11 },
	{ 1,  9, 5,  8 },
	{ 2, 10, 6,  9 },
	{ 3, 11, 7, 10 },
	{ 4,  5, 6,  7 }
};
/* PHASE 1 */


/* PHASE 2 */
int phase2_corner[6561][6][3], phase2_edge[495][6][3];
char phase2_corner_vis[6561], phase2_edge_vis[495];
int phase2_last[3342336];
char phase2_oper[3342336];
/*
*      >----------v
*      | +------+ |
*      | | 3   7| |
*      | |      | |
*      *<| 0   4|-<
* +------+------+------+------+
* | 3   0| 0   4| 4   7| 7   3|
* |      |      |      |      |
* | 2   1| 1   5| 5   6| 6   2|
* +------+------+------+------+
*        | 1   5|
*        |      |
*        | 2   6|
*        +------+
*
* phase2에서 돌아가는 코너 조각의 순서
* 이건 뭔 순서인지 모르겠다
*/
const int corner_oper[6][4] = {
	{ 0, 3, 7, 4 },
	{ 0, 4, 5, 1 },
	{ 4, 7, 6, 5 },
	{ 2, 6, 7, 3 },
	{ 0, 1, 2, 3 },
	{ 1, 5, 6, 2 }
};
/*
*      >----------v
*      | +------+ |
*      | |   2  | |
*      | | 3   1| |
*      *<|   0  |-<
* +------+------+------+------+
* |   3  |   0  |   1  |   2  |
* |10  11|11   8| 8   9| 9  10|
* |   7  |   4  |   5  |   6  |
* +------+------+------+------+
*        |   4  |
*        | 7   5|
*        |   6  |
*        +------+
*
* phase2에서 돌아가는 엣지 조각의 순서
* phase1과 동일하기 때문에 하나만 있어도 될 듯 함
*/
const int oper2_edge[6][4] = {
	//{ 2,  1, 0,  3 },
	{ 0,  3, 2,  1 },
	{ 0,  8, 4, 11 },
	{ 1,  9, 5,  8 },
	{ 2, 10, 6,  9 },
	{ 3, 11, 7, 10 },
	{ 4,  5, 6,  7 }
};
/* PHASE 2 */


/* PHASE 3 */
int phase3_corner_perm_cnt = 0, phase3_corner_perm_chk[8];
int phase3_corner[40320][6][3], phase3_edge[70][6][3];
int phase3_corner_perm[40320];
char phase3_corner_vis[40320], phase3_edge_vis[70];
int phase3_last[2822400];
char phase3_oper[2822400], phase3_is_end[2822400];
/* PHASE 3 */


/* PHASE 4 */
int phase4_edge_perm_cnt = 0, phase4_edge_perm_chk[12];
int phase4_corner[96][6][3], phase4_edge[13824][6][3];
int phase4_corner_perm[96];
ll phase4_edge_perm[13824];
char phase4_corner_vis[96], phase4_edge_vis[13824];
int phase4_last[1327104];
char phase4_oper[1327104];
/*
*        +------+
*        |   2  |
*        | 3   1|
*        |   0  |
* +------+------+------+------+
* |   3  |   0  |   1  |   2  |
* |10  11|11   8| 8   9| 9  10|
* |   7  |   4  |   5  |   6  |
* +------+------+------+------+
*        |   4  |
*        | 7   5|
*        |   6  |
*        +------+
* 이건 뭘까?
* phase4일 때 엣지 조각의 가능한 상태
*/
const int oper4_edge[12][12] = {
	{ 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0 },
	{ 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0 },
	{ 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0 },
	{ 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0 },
	{ 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0 },
	{ 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0 },
	{ 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0 },
	{ 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0 },
	{ 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1 },
	{ 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1 },
	{ 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1 },
	{ 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1 }
};
/* PHASE 4 */


void move_cw(const int& f /* face */) {
	//옆면 회전
	pre[0] = S[side_od[f][9]];
	pre[1] = S[side_od[f][10]];
	pre[2] = S[side_od[f][11]];
	for (int i = 11; i >= 3; i--) S[side_od[f][i]] = S[side_od[f][i - 3]];
	for (int i = 0; i < 3; i++) S[side_od[f][i]] = pre[i];
	//윗면 회전
	pre[1] = S[f * 9 + 7];
	pre[2] = S[f * 9 + 8];
	for (int i = 8; i >= 3; i--) S[f * 9 + i] = S[f * 9 + (i - 2)];
	S[f * 9 + 1] = pre[1];
	S[f * 9 + 2] = pre[2];
	return;
}
void move_ccw(const int& f /* face */) {
	//옆면 회전
	pre[0] = S[side_od[f][0]];
	pre[1] = S[side_od[f][1]];
	pre[2] = S[side_od[f][2]];
	for (int i = 0; i < 9; i++) S[side_od[f][i]] = S[side_od[f][i + 3]];
	for (int i = 9; i < 12; i++) S[side_od[f][i]] = pre[i - 9];
	//윗면 회전
	pre[1] = S[f * 9 + 1];
	pre[2] = S[f * 9 + 2];
	for (int i = 1; i <= 6; i++) S[f * 9 + i] = S[f * 9 + (i + 2)];
	S[f * 9 + 7] = pre[1];
	S[f * 9 + 8] = pre[2];
	return;
}
void move_180(const int& f /* face */) {
	//옆면 회전
	for (int i = 0; i < 6; i++) std::swap(S[side_od[f][i]], S[side_od[f][i + 6]]);
	//윗면 회전
	for (int i = 1; i <= 4; i++) std::swap(S[f * 9 + i], S[f * 9 + (i + 4)]);
	return;
}
void move(const int& o) {
	assert(0 < o && o < 60);
	int f = o / 10, p = o % 10;
	assert(1 <= p && p <= 3);
	if (p == 1) move_cw(f);
	if (p == 2) move_180(f);
	if (p == 3) move_ccw(f);
	return;
}
void solve(const int& len) {
	for (int i = 0; i < len; i++) move(res[i]);
	return;
}

void random25() {
	for (int i = 0; i < 6; i++)
		for (int j = 0; j < 9; j++)
			S[i * 9 + j] = i + 1;
	for (int i = 0; i < 25; i++) move(rand() % 6 * 10 + rand() % 3 + 1);
	return;
}
bool check() {
	for (int i = 0; i < 6; i++)
		for (int j = 0; j < 9; j++)
			if (S[i * 9 + j] != i + 1) return 0;
	return 1;
}
//엣지 조각의 상태를 비트마스킹하여 정수형으로 반환.
//1인 엣지는 오리엔테이션이 반대
int check_edge_parity() {
	int ret = 0;
	for (int i = 0; i < 8; i++) {//위 아래 8개
		if (S[edge_od[i][1]] == 1 || S[edge_od[i][1]] == 6) {//윗면이나 아랫면의 오리엔테이션이 맞지 않다면
			ret ^= ((S[edge_od[i][0]] ^ i ^ 1) & 1) << i;//옆면의 위치가 정위치 혹은 반대 위치인지 확인
		}
		else ret ^= ((S[edge_od[i][1]] ^ i) & 1) << i;
	}
	for (int i = 8; i < 12; i++) {//옆 4개
		if (S[edge_od[i][1]] == 1 || S[edge_od[i][1]] == 6) {//
			ret ^= ((S[edge_od[i][0]] ^ i) & 1) << i;
		}
		else ret ^= ((S[edge_od[i][1]] ^ i ^ 1) & 1) << i;
	}
	return ret;
}
void prec_phase1() {
	int x, y, bit;//x: 현재 상태, y: 변할 상태, bit: 선택한 비트
	int qf = 0, qr = 0;
	memset(phase1_last, -1, sizeof phase1_last);
	phase1_last[0] = 0;
	Q[qf++] = 0;
	while (qf > qr) {
		x = Q[qr++];
		for (int i = 0; i < 6; i++) {
			y = x;
			if (i == 0) y ^= 15;//윗면, 00001111
			else if (i == 5) y ^= 240;//아랫면, 11110000
			for (int j = 1; j <= 3; j++) {
				bit = ((y >> oper_edge[i][3]) & 1);
				for (int k = 3; k >= 1; k--) {
					y -= (y & (1 << oper_edge[i][k]));
					y += (((y >> oper_edge[i][k - 1]) & 1) << oper_edge[i][k]);
				}
				y -= (y & (1 << oper_edge[i][0]));
				y += (bit << oper_edge[i][0]);
				if ((i == 0 || i == 5) && j == 2) continue;
				if (phase1_last[y] < 0) {
					Q[qf++] = y;
					phase1_last[y] = x;
					phase1_oper[y] = i * 10 + (4 - j);
					phase1_oper[y] = phase1_dist[x] + 1;
				}
			}
		}
	}
	return;
}
void query() {
	for (int i = 0; i < 54; i++) std::cin >> S[tile_od[i]];

}
void solve() {
	std::cin.tie(0)->sync_with_stdio(0);
	std::cout.tie(0);
	std::cin >> N;
	//
	while (N--) query();
}
int main() { solve(); return 0; }